/**
* Copyright (c), 2015-2025
* @file gui_interface.h
* @brief gui接口头文件
* @author
* @date 
*/

#ifndef _GUI_INTERFACE_H_
#define _GUI_INTERFACE_H_

/*********************************************************************
*							头文件
**********************************************************************/

//#include "inf_lcd.h"
#include "tftlcd.h"
/*********************************************************************
*							宏定义
**********************************************************************/

/**
* @brief 屏幕尺寸
*/

#define LCD_WIDTH			240
#define LCD_HEIGHT		135

/*********************************************************************
*							函数
**********************************************************************/

/**
* @brief 画点
* @param x:x坐标
* @param y:y坐标
* @param show:0:不显示,1:显示
*/

void gui_interface_draw_pixel(uint16_t x,uint16_t y,uint8_t show);

#endif


